Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs.LinkedResourcePathName
Path of the linked resource.
Since:
2018

Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs.ResourceType
The desired linked resource type.
Since:
2018

Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs
The event arguments used by Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpening.
Since:
2018